Autodesk.Navisworks.Api.Tool.ZoneCreateCornerToCornerHeight
Create Zones by a corner to corner defined rectangle with a height.

Autodesk.Navisworks.Api.Tool.ZoneCreate3PointsHeight
Create Zones by a 3 points defined rectangle with a height.